In [1]:
import pandas as pd
import numpy as np

In [2]:
pd.DataFrame({'A': [1,2,3]})

   A
0  1
1  2
2  3

In [5]:
s=pd.Series([1,2,3,5, np.nan, 6,8])
s

0    1.0
1    2.0
2    3.0
3    5.0
4    NaN
5    6.0
6    8.0
dtype: float64

In [7]:
print(s)

0    1.0
1    2.0
2    3.0
3    5.0
4    NaN
5    6.0
6    8.0
dtype: float64

In [9]:
dates = pd.date_range("20241101", periods=6) #yyyymmdd
dates

DatetimeIndex(['2024-11-01', '2024-11-02', '2024-11-03', '2024-11-04',
               '2024-11-05', '2024-11-06'],
              dtype='datetime64[ns]', freq='D')

In [14]:
df=pd.DataFrame(np.random.randn(6,4), index=dates, columns=list("ABCD"))
df

                   A         B         C         D
2024-11-01 -0.668393 -0.576897  0.671319 -0.725978
2024-11-02  0.257016  0.214027 -0.488754  0.893367
2024-11-03 -2.005810 -0.757105 -0.150606  0.689989
2024-11-04 -1.037308  1.030581  0.250836  0.810744
2024-11-05 -0.370698 -0.104254 -0.812296  0.866765
2024-11-06 -1.104879  1.392624  1.214158  1.865242

In [21]:
dff2=pd.DataFrame(np.random.randint(15,size=(6,4)), index=dates, columns=list("ABCD"))
dff2

             A   B   C   D
2024-11-01   2   6   6  12
2024-11-02   9   5   5   2
2024-11-03   3  12  13   7
2024-11-04   2   3  11  13
2024-11-05   9   6   2   8
2024-11-06  10  11   7   5

In [27]:
df2=pd.DataFrame(
    {
    "A": 1.0,
    "B": pd.Timestamp("20040104"),
    #"C": pd.Series(1,index=list(range(4))),
    "C": pd.Series(1,index=list(range(4)),dtype="float32"),
    #"D": np.array([3]*4,dtype="int32"),
    "D": np.array([3,4,5,6]),
    "E": pd.Categorical(["test","trains","validate","try"]),
    "F": "foo",}
)
df2

     A          B    C  D         E    F
0  1.0 2004-01-04  1.0  3      test  foo
1  1.0 2004-01-04  1.0  4    trains  foo
2  1.0 2004-01-04  1.0  5  validate  foo
3  1.0 2004-01-04  1.0  6       try  foo

In [29]:
type(df2)

pandas.core.frame.DataFrame

In [30]:
df2.dtypes

A          float64
B    datetime64[s]
C          float32
D            int32
E         category
F           object
dtype: object

In [33]:
df.head(3)

                   A         B         C         D
2024-11-01 -0.668393 -0.576897  0.671319 -0.725978
2024-11-02  0.257016  0.214027 -0.488754  0.893367
2024-11-03 -2.005810 -0.757105 -0.150606  0.689989

In [34]:
df.tail(2)

                   A         B         C         D
2024-11-05 -0.370698 -0.104254 -0.812296  0.866765
2024-11-06 -1.104879  1.392624  1.214158  1.865242

In [38]:
df.index

DatetimeIndex(['2024-11-01', '2024-11-02', '2024-11-03', '2024-11-04',
               '2024-11-05', '2024-11-06'],
              dtype='datetime64[ns]', freq='D')

In [39]:
df.columns

Index(['A', 'B', 'C', 'D'], dtype='object')

In [45]:
n=df.to_numpy()
n

array([[-0.66839294, -0.57689661,  0.67131926, -0.72597822],
       [ 0.2570162 ,  0.21402666, -0.4887539 ,  0.89336656],
       [-2.00580989, -0.75710451, -0.15060577,  0.68998855],
       [-1.03730844,  1.03058054,  0.25083619,  0.81074431],
       [-0.3706981 , -0.10425363, -0.81229593,  0.8667653 ],
       [-1.10487925,  1.39262374,  1.21415807,  1.86524161]])

In [46]:
type(n)

numpy.ndarray

In [47]:
m=df2.to_numpy()
m

array([[1.0, Timestamp('2004-01-04 00:00:00'), 1.0, 3, 'test', 'foo'],
       [1.0, Timestamp('2004-01-04 00:00:00'), 1.0, 4, 'trains', 'foo'],
       [1.0, Timestamp('2004-01-04 00:00:00'), 1.0, 5, 'validate', 'foo'],
       [1.0, Timestamp('2004-01-04 00:00:00'), 1.0, 6, 'try', 'foo']],
      dtype=object)

In [48]:
type(m)

numpy.ndarray

In [49]:
df.describe()

              A         B         C         D
count  6.000000  6.000000  6.000000  6.000000
mean  -0.821679  0.199829  0.114110  0.733355
std    0.764111  0.863087  0.752467  0.832117
min   -2.005810 -0.757105 -0.812296 -0.725978
25%   -1.087987 -0.458736 -0.404217  0.720177
50%   -0.852851  0.054887  0.050115  0.838755
75%   -0.445122  0.826442  0.566198  0.886716
max    0.257016  1.392624  1.214158  1.865242

In [50]:
df2.describe()

         A                    B    C         D
count  4.0                    4  4.0  4.000000
mean   1.0  2004-01-04 00:00:00  1.0  4.500000
min    1.0  2004-01-04 00:00:00  1.0  3.000000
25%    1.0  2004-01-04 00:00:00  1.0  3.750000
50%    1.0  2004-01-04 00:00:00  1.0  4.500000
75%    1.0  2004-01-04 00:00:00  1.0  5.250000
max    1.0  2004-01-04 00:00:00  1.0  6.000000
std    0.0                  NaN  0.0  1.290994

In [51]:
df.T

   2024-11-01  2024-11-02  2024-11-03  2024-11-04  2024-11-05  2024-11-06
A   -0.668393    0.257016   -2.005810   -1.037308   -0.370698   -1.104879
B   -0.576897    0.214027   -0.757105    1.030581   -0.104254    1.392624
C    0.671319   -0.488754   -0.150606    0.250836   -0.812296    1.214158
D   -0.725978    0.893367    0.689989    0.810744    0.866765    1.865242

In [54]:
df.sort_index(axis=1,ascending=False)

                   D         C         B         A
2024-11-01 -0.725978  0.671319 -0.576897 -0.668393
2024-11-02  0.893367 -0.488754  0.214027  0.257016
2024-11-03  0.689989 -0.150606 -0.757105 -2.005810
2024-11-04  0.810744  0.250836  1.030581 -1.037308
2024-11-05  0.866765 -0.812296 -0.104254 -0.370698
2024-11-06  1.865242  1.214158  1.392624 -1.104879

In [55]:
df.sort_index(axis=0,ascending=False)

                   A         B         C         D
2024-11-06 -1.104879  1.392624  1.214158  1.865242
2024-11-05 -0.370698 -0.104254 -0.812296  0.866765
2024-11-04 -1.037308  1.030581  0.250836  0.810744
2024-11-03 -2.005810 -0.757105 -0.150606  0.689989
2024-11-02  0.257016  0.214027 -0.488754  0.893367
2024-11-01 -0.668393 -0.576897  0.671319 -0.725978

In [56]:
df["A"]

2024-11-01   -0.668393
2024-11-02    0.257016
2024-11-03   -2.005810
2024-11-04   -1.037308
2024-11-05   -0.370698
2024-11-06   -1.104879
Freq: D, Name: A, dtype: float64

In [71]:
df[0:3]

                   A         B         C         D
2024-11-01 -0.668393 -0.576897  0.671319 -0.725978
2024-11-02  0.257016  0.214027 -0.488754  0.893367
2024-11-03 -2.005810 -0.757105 -0.150606  0.689989

In [72]:
df["20241102":"20241104"] #slice till

                   A         B         C         D
2024-11-02  0.257016  0.214027 -0.488754  0.893367
2024-11-03 -2.005810 -0.757105 -0.150606  0.689989
2024-11-04 -1.037308  1.030581  0.250836  0.810744

### Loc
loc is applied to dataframes only

In [73]:
df.loc[dates[0]] #for row matching/selecting

A   -0.668393
B   -0.576897
C    0.671319
D   -0.725978
Name: 2024-11-01 00:00:00, dtype: float64

In [74]:
df.loc[:,["A","B"]]

                   A         B
2024-11-01 -0.668393 -0.576897
2024-11-02  0.257016  0.214027
2024-11-03 -2.005810 -0.757105
2024-11-04 -1.037308  1.030581
2024-11-05 -0.370698 -0.104254
2024-11-06 -1.104879  1.392624

In [75]:
df.loc[dates[0],["A","D"]]

A   -0.668393
D   -0.725978
Name: 2024-11-01 00:00:00, dtype: float64

In [76]:
df.loc["20241102":"20241104",["A","C"]]

                   A         C
2024-11-02  0.257016 -0.488754
2024-11-03 -2.005810 -0.150606
2024-11-04 -1.037308  0.250836

In [84]:
#df.loc["20241102":"20241104",0:2] #error

### Fast Access Scalar: at (will always give single value, faster than loc)

In [77]:
df.at[dates[0],"A"]

-0.6683929378512177

In [79]:
#df.at[:,["A","B"]] #error

In [80]:
df.iloc[3]

A   -1.037308
B    1.030581
C    0.250836
D    0.810744
Name: 2024-11-04 00:00:00, dtype: float64

In [81]:
df

                   A         B         C         D
2024-11-01 -0.668393 -0.576897  0.671319 -0.725978
2024-11-02  0.257016  0.214027 -0.488754  0.893367
2024-11-03 -2.005810 -0.757105 -0.150606  0.689989
2024-11-04 -1.037308  1.030581  0.250836  0.810744
2024-11-05 -0.370698 -0.104254 -0.812296  0.866765
2024-11-06 -1.104879  1.392624  1.214158  1.865242

In [86]:
df.iloc[3:,0:2] #in loc we cannot slice column by index, we have to give column name

                   A         B
2024-11-04 -1.037308  1.030581
2024-11-05 -0.370698 -0.104254
2024-11-06 -1.104879  1.392624

In [87]:
df.iloc[[1,2,4],[0,2]]

                   A         C
2024-11-02  0.257016 -0.488754
2024-11-03 -2.005810 -0.150606
2024-11-05 -0.370698 -0.812296

In [88]:
df.iloc[1,1]

0.2140266550806666

In [89]:
df.iat[1,1]

0.2140266550806666

In [93]:
df[df["C"]>0]

                   A         B         C         D
2024-11-01 -0.668393 -0.576897  0.671319 -0.725978
2024-11-04 -1.037308  1.030581  0.250836  0.810744
2024-11-06 -1.104879  1.392624  1.214158  1.865242

In [94]:
df[df>0]

                   A         B         C         D
2024-11-01       NaN       NaN  0.671319       NaN
2024-11-02  0.257016  0.214027       NaN  0.893367
2024-11-03       NaN       NaN       NaN  0.689989
2024-11-04       NaN  1.030581  0.250836  0.810744
2024-11-05       NaN       NaN       NaN  0.866765
2024-11-06       NaN  1.392624  1.214158  1.865242

### isin method for filtering

In [95]:
df3=df.copy()
df3

                   A         B         C         D
2024-11-01 -0.668393 -0.576897  0.671319 -0.725978
2024-11-02  0.257016  0.214027 -0.488754  0.893367
2024-11-03 -2.005810 -0.757105 -0.150606  0.689989
2024-11-04 -1.037308  1.030581  0.250836  0.810744
2024-11-05 -0.370698 -0.104254 -0.812296  0.866765
2024-11-06 -1.104879  1.392624  1.214158  1.865242

In [99]:
df3["E"]=["one","one","two","three","four",np.nan]
df3

                   A         B         C         D      E
2024-11-01 -0.668393 -0.576897  0.671319 -0.725978    one
2024-11-02  0.257016  0.214027 -0.488754  0.893367    one
2024-11-03 -2.005810 -0.757105 -0.150606  0.689989    two
2024-11-04 -1.037308  1.030581  0.250836  0.810744  three
2024-11-05 -0.370698 -0.104254 -0.812296  0.866765   four
2024-11-06 -1.104879  1.392624  1.214158  1.865242    NaN

In [101]:
df3[df3["E"].isin(["five","four"])]

                   A         B         C         D     E
2024-11-05 -0.370698 -0.104254 -0.812296  0.866765  four

In [105]:
df.iat[0,1]=2 #to change any specific value
df

                   A         B         C         D
2024-11-01 -0.668393  2.000000  0.671319 -0.725978
2024-11-02  0.257016  0.214027 -0.488754  0.893367
2024-11-03 -2.005810 -0.757105 -0.150606  0.689989
2024-11-04 -1.037308  1.030581  0.250836  0.810744
2024-11-05 -0.370698 -0.104254 -0.812296  0.866765
2024-11-06 -1.104879  1.392624  1.214158  1.865242

In [107]:
df.loc[:,"D"]=np.array([5]*len(df))
df

                   A         B         C    D
2024-11-01 -0.668393  2.000000  0.671319  5.0
2024-11-02  0.257016  0.214027 -0.488754  5.0
2024-11-03 -2.005810 -0.757105 -0.150606  5.0
2024-11-04 -1.037308  1.030581  0.250836  5.0
2024-11-05 -0.370698 -0.104254 -0.812296  5.0
2024-11-06 -1.104879  1.392624  1.214158  5.0

In [110]:
df.iloc[:,3]=np.array([4]*len(df))
df

                   A         B         C    D
2024-11-01 -0.668393  2.000000  0.671319  4.0
2024-11-02  0.257016  0.214027 -0.488754  4.0
2024-11-03 -2.005810 -0.757105 -0.150606  4.0
2024-11-04 -1.037308  1.030581  0.250836  4.0
2024-11-05 -0.370698 -0.104254 -0.812296  4.0
2024-11-06 -1.104879  1.392624  1.214158  4.0

In [111]:
df2

     A          B    C  D         E    F
0  1.0 2004-01-04  1.0  3      test  foo
1  1.0 2004-01-04  1.0  4    trains  foo
2  1.0 2004-01-04  1.0  5  validate  foo
3  1.0 2004-01-04  1.0  6       try  foo

In [116]:
df[df<0]=-df
df

                   A         B         C    D
2024-11-01  0.668393  2.000000  0.671319  4.0
2024-11-02       NaN       NaN       NaN  4.0
2024-11-03  2.005810  0.757105       NaN  4.0
2024-11-04  1.037308  1.030581       NaN  4.0
2024-11-05       NaN       NaN  0.812296  4.0
2024-11-06  1.104879  1.392624  1.214158  4.0

In [117]:
df[df<0.5]=np.nan
df

                   A         B         C    D
2024-11-01  0.668393  2.000000  0.671319  4.0
2024-11-02       NaN       NaN       NaN  4.0
2024-11-03  2.005810  0.757105       NaN  4.0
2024-11-04  1.037308  1.030581       NaN  4.0
2024-11-05       NaN       NaN  0.812296  4.0
2024-11-06  1.104879  1.392624  1.214158  4.0

In [118]:
df.dropna(how="any")

                   A         B         C    D
2024-11-01  0.668393  2.000000  0.671319  4.0
2024-11-06  1.104879  1.392624  1.214158  4.0

In [119]:
df.iat[0,1]=np.nan
df

                   A         B         C    D
2024-11-01  0.668393       NaN  0.671319  4.0
2024-11-02       NaN       NaN       NaN  4.0
2024-11-03  2.005810  0.757105       NaN  4.0
2024-11-04  1.037308  1.030581       NaN  4.0
2024-11-05       NaN       NaN  0.812296  4.0
2024-11-06  1.104879  1.392624  1.214158  4.0

In [120]:
df.fillna(value=4)

                   A         B         C    D
2024-11-01  0.668393  4.000000  0.671319  4.0
2024-11-02  4.000000  4.000000  4.000000  4.0
2024-11-03  2.005810  0.757105  4.000000  4.0
2024-11-04  1.037308  1.030581  4.000000  4.0
2024-11-05  4.000000  4.000000  0.812296  4.0
2024-11-06  1.104879  1.392624  1.214158  4.0

In [17]:
df3=pd.DataFrame([[1,np.nan,2],[2,3,5],[np.nan,4,6]])

In [18]:
df3[3]=np.nan
df3

     0    1  2   3
0  1.0  NaN  2 NaN
1  2.0  3.0  5 NaN
2  NaN  4.0  6 NaN

In [23]:
df3.dropna(thresh=3)

     0    1  2   3
1  2.0  3.0  5 NaN

In [25]:
df4=pd.DataFrame([[1,np.nan,np.nan,3],[np.nan,3,5,np.nan],[45,np.nan,np.nan,np.nan],[np.nan,np.nan,15,np.nan]])
df4

      0    1     2    3
0   1.0  NaN   NaN  3.0
1   NaN  3.0   5.0  NaN
2  45.0  NaN   NaN  NaN
3   NaN  NaN  15.0  NaN

In [26]:
df4.fillna(method='ffill')

C:\Users\Student\AppData\Local\Temp\ipykernel_3904\2804016351.py:1: FutureWarning: DataFrame.fillna with 'method' is deprecated and will raise in a future version. Use obj.ffill() or obj.bfill() instead.
  df4.fillna(method='ffill')

      0    1     2    3
0   1.0  NaN   NaN  3.0
1   1.0  3.0   5.0  3.0
2  45.0  3.0   5.0  3.0
3  45.0  3.0  15.0  3.0

In [28]:
df4.fillna(method='ffill',axis=1)

C:\Users\Student\AppData\Local\Temp\ipykernel_3904\3014200575.py:1: FutureWarning: DataFrame.fillna with 'method' is deprecated and will raise in a future version. Use obj.ffill() or obj.bfill() instead.
  df4.fillna(method='ffill',axis=1)

      0     1     2     3
0   1.0   1.0   1.0   3.0
1   NaN   3.0   5.0   5.0
2  45.0  45.0  45.0  45.0
3   NaN   NaN  15.0  15.0

In [27]:
df4.fillna(method='bfill')

C:\Users\Student\AppData\Local\Temp\ipykernel_3904\3500302470.py:1: FutureWarning: DataFrame.fillna with 'method' is deprecated and will raise in a future version. Use obj.ffill() or obj.bfill() instead.
  df4.fillna(method='bfill')

      0    1     2    3
0   1.0  3.0   5.0  3.0
1  45.0  3.0   5.0  NaN
2  45.0  NaN  15.0  NaN
3   NaN  NaN  15.0  NaN

In [29]:
df4.fillna(method='bfill',axis=1)

C:\Users\Student\AppData\Local\Temp\ipykernel_3904\443869962.py:1: FutureWarning: DataFrame.fillna with 'method' is deprecated and will raise in a future version. Use obj.ffill() or obj.bfill() instead.
  df4.fillna(method='bfill',axis=1)

      0     1     2    3
0   1.0   3.0   3.0  3.0
1   3.0   3.0   5.0  NaN
2  45.0   NaN   NaN  NaN
3  15.0  15.0  15.0  NaN

In [35]:
df5=pd.DataFrame(np.random.randint(0,5,(10,7)))
df5

   0  1  2  3  4  5  6
0  3  2  2  0  4  4  1
1  1  0  4  1  0  3  2
2  4  4  4  3  2  3  2
3  2  4  1  1  2  3  1
4  3  2  2  1  3  1  1
5  0  2  2  0  4  0  1
6  4  2  1  2  0  1  1
7  3  1  0  0  0  4  2
8  2  4  1  2  3  3  4
9  4  2  4  3  0  3  3

In [36]:
df5.to_csv("first.csv")

In [37]:
pd.read_csv("first.csv")

   Unnamed: 0  0  1  2  3  4  5  6
0           0  3  2  2  0  4  4  1
1           1  1  0  4  1  0  3  2
2           2  4  4  4  3  2  3  2
3           3  2  4  1  1  2  3  1
4           4  3  2  2  1  3  1  1
5           5  0  2  2  0  4  0  1
6           6  4  2  1  2  0  1  1
7           7  3  1  0  0  0  4  2
8           8  2  4  1  2  3  3  4
9           9  4  2  4  3  0  3  3

In [38]:
df5.to_parquet("firstpar.parquet")

In [39]:
pd.read_parquet("firstpar.parquet")

   0  1  2  3  4  5  6
0  3  2  2  0  4  4  1
1  1  0  4  1  0  3  2
2  4  4  4  3  2  3  2
3  2  4  1  1  2  3  1
4  3  2  2  1  3  1  1
5  0  2  2  0  4  0  1
6  4  2  1  2  0  1  1
7  3  1  0  0  0  4  2
8  2  4  1  2  3  3  4
9  4  2  4  3  0  3  3

In [42]:
df5.to_excel("firstexe.xlsx",sheet_name="Sheet1")

In [43]:
pd.read_excel("firstexe.xlsx","Sheet1")

   Unnamed: 0  0  1  2  3  4  5  6
0           0  3  2  2  0  4  4  1
1           1  1  0  4  1  0  3  2
2           2  4  4  4  3  2  3  2
3           3  2  4  1  1  2  3  1
4           4  3  2  2  1  3  1  1
5           5  0  2  2  0  4  0  1
6           6  4  2  1  2  0  1  1
7           7  3  1  0  0  0  4  2
8           8  2  4  1  2  3  3  4
9           9  4  2  4  3  0  3  3

In [54]:
result = pd.read_csv("C:/Users/Student/Desktop/result.csv")
result

    Roll Number  LT  AOS  FSD  DAIE
0             1  25   36   34    29
1             2  26   29   35    32
2             3  22   30   36    29
3             4  23   31   37    30
4             5  24   32   38    31
5             6  25   33   39    32
6             7  26   34   40    33
7             8  27   35   41    34
8             9  28   36   42    35
9            10  29   37   43    36
10           11  30   38   44    37
11           12  31   39   45    38
12           13  32   40   46    39
13           14  33   41   47    40
14           15  34   42   48    41
15           16  35   43   49    42
16           17  36   44   50    43
17           18  37   45   51    44
18           19  38   46   52    45
19           20  39   47   53    46
20           21  40   48   54    47
21           22  41   49   55    48
22           23  42   50   56    49
23           24  43   51   57    50
24           25  44   52   58    51
25           26  45   53   59    52
26           27  46   54   60    53
27           28  47   55   61    54
28           29  48   56   62    55
29           30  49   57   63    56

In [55]:
import sklearn.datasets as data

In [58]:
df6 = data.load_iris()
df6

{'data': array([[5.1, 3.5, 1.4, 0.2],
        [4.9, 3. , 1.4, 0.2],
        [4.7, 3.2, 1.3, 0.2],
        [4.6, 3.1, 1.5, 0.2],
        [5. , 3.6, 1.4, 0.2],
        [5.4, 3.9, 1.7, 0.4],
        [4.6, 3.4, 1.4, 0.3],
        [5. , 3.4, 1.5, 0.2],
        [4.4, 2.9, 1.4, 0.2],
        [4.9, 3.1, 1.5, 0.1],
        [5.4, 3.7, 1.5, 0.2],
        [4.8, 3.4, 1.6, 0.2],
        [4.8, 3. , 1.4, 0.1],
        [4.3, 3. , 1.1, 0.1],
        [5.8, 4. , 1.2, 0.2],
        [5.7, 4.4, 1.5, 0.4],
        [5.4, 3.9, 1.3, 0.4],
        [5.1, 3.5, 1.4, 0.3],
        [5.7, 3.8, 1.7, 0.3],
        [5.1, 3.8, 1.5, 0.3],
        [5.4, 3.4, 1.7, 0.2],
        [5.1, 3.7, 1.5, 0.4],
        [4.6, 3.6, 1. , 0.2],
        [5.1, 3.3, 1.7, 0.5],
        [4.8, 3.4, 1.9, 0.2],
        [5. , 3. , 1.6, 0.2],
        [5. , 3.4, 1.6, 0.4],
        [5.2, 3.5, 1.5, 0.2],
        [5.2, 3.4, 1.4, 0.2],
        [4.7, 3.2, 1.6, 0.2],
        [4.8, 3.1, 1.6, 0.2],
        [5.4, 3.4, 1.5, 0.4],
        [5.2, 4.1, 1.5, 0.1],
        [5.5, 4.2, 1.4, 0.2],
        [4.9, 3.1, 1.5, 0.2],
        [5. , 3.2, 1.2, 0.2],
        [5.5, 3.5, 1.3, 0.2],
        [4.9, 3.6, 1.4, 0.1],
        [4.4, 3. , 1.3, 0.2],
        [5.1, 3.4, 1.5, 0.2],
        [5. , 3.5, 1.3, 0.3],
        [4.5, 2.3, 1.3, 0.3],
        [4.4, 3.2, 1.3, 0.2],
        [5. , 3.5, 1.6, 0.6],
        [5.1, 3.8, 1.9, 0.4],
        [4.8, 3. , 1.4, 0.3],
        [5.1, 3.8, 1.6, 0.2],
        [4.6, 3.2, 1.4, 0.2],
        [5.3, 3.7, 1.5, 0.2],
        [5. , 3.3, 1.4, 0.2],
        [7. , 3.2, 4.7, 1.4],
        [6.4, 3.2, 4.5, 1.5],
        [6.9, 3.1, 4.9, 1.5],
        [5.5, 2.3, 4. , 1.3],
        [6.5, 2.8, 4.6, 1.5],
        [5.7, 2.8, 4.5, 1.3],
        [6.3, 3.3, 4.7, 1.6],
        [4.9, 2.4, 3.3, 1. ],
        [6.6, 2.9, 4.6, 1.3],
        [5.2, 2.7, 3.9, 1.4],
        [5. , 2. , 3.5, 1. ],
        [5.9, 3. , 4.2, 1.5],
        [6. , 2.2, 4. , 1. ],
        [6.1, 2.9, 4.7, 1.4],
        [5.6, 2.9, 3.6, 1.3],
        [6.7, 3.1, 4.4, 1.4],
        [5.6, 3. , 4.5, 1.5],
        [5.8, 2.7, 4.1, 1. ],
        [6.2, 2.2, 4.5, 1.5],
        [5.6, 2.5, 3.9, 1.1],
        [5.9, 3.2, 4.8, 1.8],
        [6.1, 2.8, 4. , 1.3],
        [6.3, 2.5, 4.9, 1.5],
        [6.1, 2.8, 4.7, 1.2],
        [6.4, 2.9, 4.3, 1.3],
        [6.6, 3. , 4.4, 1.4],
        [6.8, 2.8, 4.8, 1.4],
        [6.7, 3. , 5. , 1.7],
        [6. , 2.9, 4.5, 1.5],
        [5.7, 2.6, 3.5, 1. ],
        [5.5, 2.4, 3.8, 1.1],
        [5.5, 2.4, 3.7, 1. ],
        [5.8, 2.7, 3.9, 1.2],
        [6. , 2.7, 5.1, 1.6],
        [5.4, 3. , 4.5, 1.5],
        [6. , 3.4, 4.5, 1.6],
        [6.7, 3.1, 4.7, 1.5],
        [6.3, 2.3, 4.4, 1.3],
        [5.6, 3. , 4.1, 1.3],
        [5.5, 2.5, 4. , 1.3],
        [5.5, 2.6, 4.4, 1.2],
        [6.1, 3. , 4.6, 1.4],
        [5.8, 2.6, 4. , 1.2],
        [5. , 2.3, 3.3, 1. ],
        [5.6, 2.7, 4.2, 1.3],
        [5.7, 3. , 4.2, 1.2],
        [5.7, 2.9, 4.2, 1.3],
        [6.2, 2.9, 4.3, 1.3],
        [5.1, 2.5, 3. , 1.1],
        [5.7, 2.8, 4.1, 1.3],
        [6.3, 3.3, 6. , 2.5],
        [5.8, 2.7, 5.1, 1.9],
        [7.1, 3. , 5.9, 2.1],
        [6.3, 2.9, 5.6, 1.8],
        [6.5, 3. , 5.8, 2.2],
        [7.6, 3. , 6.6, 2.1],
        [4.9, 2.5, 4.5, 1.7],
        [7.3, 2.9, 6.3, 1.8],
        [6.7, 2.5, 5.8, 1.8],
        [7.2, 3.6, 6.1, 2.5],
        [6.5, 3.2, 5.1, 2. ],
        [6.4, 2.7, 5.3, 1.9],
        [6.8, 3. , 5.5, 2.1],
        [5.7, 2.5, 5. , 2. ],
        [5.8, 2.8, 5.1, 2.4],
        [6.4, 3.2, 5.3, 2.3],
        [6.5, 3. , 5.5, 1.8],
        [7.7, 3.8, 6.7, 2.2],
        [7.7, 2.6, 6.9, 2.3],
        [6. , 2.2, 5. , 1.5],
        [6.9, 3.2, 5.7, 2.3],
        [5.6, 2.8, 4.9, 2. ],
        [7.7, 2.8, 6.7, 2. ],
        [6.3, 2.7, 4.9, 1.8],
        [6.7, 3.3, 5.7, 2.1],
        [7.2, 3.2, 6. , 1.8],
        [6.2, 2.8, 4.8, 1.8],
        [6.1, 3. , 4.9, 1.8],
        [6.4, 2.8, 5.6, 2.1],
        [7.2, 3. , 5.8, 1.6],
        [7.4, 2.8, 6.1, 1.9],
        [7.9, 3.8, 6.4, 2. ],
        [6.4, 2.8, 5.6, 2.2],
        [6.3, 2.8, 5.1, 1.5],
        [6.1, 2.6, 5.6, 1.4],
        [7.7, 3. , 6.1, 2.3],
        [6.3, 3.4, 5.6, 2.4],
        [6.4, 3.1, 5.5, 1.8],
        [6. , 3. , 4.8, 1.8],
        [6.9, 3.1, 5.4, 2.1],
        [6.7, 3.1, 5.6, 2.4],
        [6.9, 3.1, 5.1, 2.3],
        [5.8, 2.7, 5.1, 1.9],
        [6.8, 3.2, 5.9, 2.3],
        [6.7, 3.3, 5.7, 2.5],
        [6.7, 3. , 5.2, 2.3],
        [6.3, 2.5, 5. , 1.9],
        [6.5, 3. , 5.2, 2. ],
        [6.2, 3.4, 5.4, 2.3],
        [5.9, 3. , 5.1, 1.8]]),
 'target': array([0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0,
        0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0,
        0, 0, 0, 0, 0, 0, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1,
        1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1,
        1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2,
        2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2,
        2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2]),
 'frame': None,
 'target_names': array(['setosa', 'versicolor', 'virginica'], dtype='<U10'),
 'DESCR': '.. _iris_dataset:\n\nIris plants dataset\n--------------------\n\n**Data Set Characteristics:**\n\n    :Number of Instances: 150 (50 in each of three classes)\n    :Number of Attributes: 4 numeric, predictive attributes and the class\n    :Attribute Information:\n        - sepal length in cm\n        - sepal width in cm\n        - petal length in cm\n        - petal width in cm\n        - class:\n                - Iris-Setosa\n                - Iris-Versicolour\n                - Iris-Virginica\n                \n    :Summary Statistics:\n\n    ============== ==== ==== ======= ===== ====================\n                    Min  Max   Mean    SD   Class Correlation\n    ============== ==== ==== ======= ===== ====================\n    sepal length:   4.3  7.9   5.84   0.83    0.7826\n    sepal width:    2.0  4.4   3.05   0.43   -0.4194\n    petal length:   1.0  6.9   3.76   1.76    0.9490  (high!)\n    petal width:    0.1  2.5   1.20   0.76    0.9565  (high!)\n    ============== ==== ==== ======= ===== ====================\n\n    :Missing Attribute Values: None\n    :Class Distribution: 33.3% for each of 3 classes.\n    :Creator: R.A. Fisher\n    :Donor: Michael Marshall (MARSHALL%PLU@io.arc.nasa.gov)\n    :Date: July, 1988\n\nThe famous Iris database, first used by Sir R.A. Fisher. The dataset is taken\nfrom Fisher\'s paper. Note that it\'s the same as in R, but not as in the UCI\nMachine Learning Repository, which has two wrong data points.\n\nThis is perhaps the best known database to be found in the\npattern recognition literature.  Fisher\'s paper is a classic in the field and\nis referenced frequently to this day.  (See Duda & Hart, for example.)  The\ndata set contains 3 classes of 50 instances each, where each class refers to a\ntype of iris plant.  One class is linearly separable from the other 2; the\nlatter are NOT linearly separable from each other.\n\n.. topic:: References\n\n   - Fisher, R.A. "The use of multiple measurements in taxonomic problems"\n     Annual Eugenics, 7, Part II, 179-188 (1936); also in "Contributions to\n     Mathematical Statistics" (John Wiley, NY, 1950).\n   - Duda, R.O., & Hart, P.E. (1973) Pattern Classification and Scene Analysis.\n     (Q327.D83) John Wiley & Sons.  ISBN 0-471-22361-1.  See page 218.\n   - Dasarathy, B.V. (1980) "Nosing Around the Neighborhood: A New System\n     Structure and Classification Rule for Recognition in Partially Exposed\n     Environments".  IEEE Transactions on Pattern Analysis and Machine\n     Intelligence, Vol. PAMI-2, No. 1, 67-71.\n   - Gates, G.W. (1972) "The Reduced Nearest Neighbor Rule".  IEEE Transactions\n     on Information Theory, May 1972, 431-433.\n   - See also: 1988 MLC Proceedings, 54-64.  Cheeseman et al"s AUTOCLASS II\n     conceptual clustering system finds 3 classes in the data.\n   - Many, many more ...',
 'feature_names': ['sepal length (cm)',
  'sepal width (cm)',
  'petal length (cm)',
  'petal width (cm)'],
 'filename': 'iris.csv',
 'data_module': 'sklearn.datasets.data'}

In [64]:
ss=pd.Series([2,40,500,1,3,900])
ss
new_min=-1
new_max=1

In [65]:
for i in range(0, 6):
    vnew = (((ss[i] - ss.min()) / (ss.max() - ss.min())) * (new_max - new_min)) + new_min
    print(vnew)

-0.9977753058954394
-0.9132369299221357
0.11012235817575089
-1.0
-0.9955506117908788
1.0

In [66]:
new_min=0
new_max=1
for i in range(0, 6):
    vnew = (((ss[i] - ss.min()) / (ss.max() - ss.min())) * (new_max - new_min)) + new_min
    print(vnew)

0.0011123470522803114
0.04338153503893215
0.5550611790878754
0.0
0.002224694104560623
1.0

In [68]:
for i in range(0, 6):
    vv = (ss[i] - ss.mean() )/ ss.std()
    print(vv)

-0.6328476310439743
-0.5322275056060203
0.6858055918007924
-0.6354955290818153
-0.6301997330061335
1.744964806937151